---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunCreationFailure
source: html/de46d3bd-dfc1-77c1-82e7-6d8ccebfdb72.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderRunCreationFailure Property

The relationship between the current values of Actual Run Width, Minimum Width at Inside Boundary, and Parallel Treads at Start or End does not support the creation of the winder run.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderRunCreationFailure { get; }
```